; domain
;; logistics domain Typed version.
;;

(define (domain logistics)
  (:requirements :strips :typing) 
  (:types truck
          airplane - vehicle
          package
          vehicle - physobj
          airport
          location - place
          city
          place 
          physobj - object)
  
  (:predicates 	(in-city ?loc - place ?city - city)
		(at ?obj - physobj ?loc - place)
		(in ?pkg - package ?veh - vehicle))
  
(:action LOAD-TRUCK
   :parameters    (?pkg - package ?truck - truck ?loc - place)
   :precondition  (and (at ?truck ?loc) (at ?pkg ?loc))
   :effect        (and (not (at ?pkg ?loc)) (in ?pkg ?truck)))

(:action LOAD-AIRPLANE
  :parameters   (?pkg - package ?airplane - airplane ?loc - place)
  :precondition (and (at ?pkg ?loc) (at ?airplane ?loc))
  :effect       (and (not (at ?pkg ?loc)) (in ?pkg ?airplane)))

(:action UNLOAD-TRUCK
  :parameters   (?pkg - package ?truck - truck ?loc - place)
  :precondition (and (at ?truck ?loc) (in ?pkg ?truck))
  :effect       (and (not (in ?pkg ?truck)) (at ?pkg ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters    (?pkg - package ?airplane - airplane ?loc - place)
  :precondition  (and (in ?pkg ?airplane) (at ?airplane ?loc))
  :effect        (and (not (in ?pkg ?airplane)) (at ?pkg ?loc)))

(:action DRIVE-TRUCK
  :parameters (?truck - truck ?loc-from - place ?loc-to - place ?city - city)
  :precondition
   (and (at ?truck ?loc-from) (in-city ?loc-from ?city) (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters (?airplane - airplane ?loc-from - airport ?loc-to - airport)
  :precondition
   (at ?airplane ?loc-from)
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-4-0)
(:domain logistics)
(:objects
 apn1 - airplane
 apt1 apt2 - airport
 pos2 pos1 - location
 cit2 cit1 - city
 tru2 tru1 - truck
 obj23 obj22 obj21 obj13 obj12 obj11 - package)

(:init (at apn1 apt2) (at tru1 pos1) (at obj11 pos1)
 (at obj12 pos1) (at obj13 pos1) (at tru2 pos2) (at obj21 pos2) (at obj22 pos2)
 (at obj23 pos2) (in-city pos1 cit1) (in-city apt1 cit1) (in-city pos2 cit2)
 (in-city apt2 cit2))

(:goal (and 
(at obj11 apt1) (at obj23 pos1) (at obj13 apt1) (at obj21 pos1) (at obj12 pos1) (at obj22 pos1) (at tru1 pos1) (at tru2 pos2) (at apn1 apt2)
))
)

; plan
1. (load-truck obj23 tru2 pos2)
   deleted: (at obj23 pos2)
   added: (in obj23 tru2)
   goals met: 4 of 9
2. (load-truck obj22 tru2 pos2)
   deleted: (at obj22 pos2)
   added: (in obj22 tru2)
   goals met: 4 of 9
3. (load-truck obj21 tru2 pos2)
   deleted: (at obj21 pos2)
   added: (in obj21 tru2)
   goals met: 4 of 9
4. (load-truck obj13 tru1 pos1)
   deleted: (at obj13 pos1)
   added: (in obj13 tru1)
   goals met: 4 of 9
5. (load-truck obj11 tru1 pos1)
   deleted: (at obj11 pos1)
   added: (in obj11 tru1)
   goals met: 4 of 9
6. (drive-truck tru2 pos2 apt2 cit2)
   deleted: (at tru2 pos2)
   added: (at tru2 apt2)
   goals met: 3 of 9
7. (unload-truck obj23 tru2 apt2)
   deleted: (in obj23 tru2)
   added: (at obj23 apt2)
   goals met: 3 of 9
8. (unload-truck obj22 tru2 apt2)
   deleted: (in obj22 tru2)
   added: (at obj22 apt2)
   goals met: 3 of 9
9. (unload-truck obj21 tru2 apt2)
   deleted: (in obj21 tru2)
   added: (at obj21 apt2)
   goals met: 3 of 9
10. (drive-truck tru2 apt2 pos2 cit2)
   deleted: (at tru2 apt2)
   added: (at tru2 pos2)
   goals met: 4 of 9
11. (load-airplane obj23 apn1 apt2)
   deleted: (at obj23 apt2)
   added: (in obj23 apn1)
   goals met: 4 of 9
12. (load-airplane obj22 apn1 apt2)
   deleted: (at obj22 apt2)
   added: (in obj22 apn1)
   goals met: 4 of 9
13. (load-airplane obj21 apn1 apt2)
   deleted: (at obj21 apt2)
   added: (in obj21 apn1)
   goals met: 4 of 9
14. (drive-truck tru1 pos1 apt1 cit1)
   deleted: (at tru1 pos1)
   added: (at tru1 apt1)
   goals met: 3 of 9
15. (unload-truck obj13 tru1 apt1)
   deleted: (in obj13 tru1)
   added: (at obj13 apt1)
   goals met: 4 of 9
16. (unload-truck obj11 tru1 apt1)
   deleted: (in obj11 tru1)
   added: (at obj11 apt1)
   goals met: 5 of 9
17. (fly-airplane apn1 apt2 apt1)
   deleted: (at apn1 apt2)
   added: (at apn1 apt1)
   goals met: 4 of 9
18. (unload-airplane obj23 apn1 apt1)
   deleted: (in obj23 apn1)
   added: (at obj23 apt1)
   goals met: 4 of 9
19. (load-truck obj23 tru1 apt1)
   deleted: (at obj23 apt1)
   added: (in obj23 tru1)
   goals met: 4 of 9
20. (unload-airplane obj22 apn1 apt1)
   deleted: (in obj22 apn1)
   added: (at obj22 apt1)
   goals met: 4 of 9
21. (load-truck obj22 tru1 apt1)
   deleted: (at obj22 apt1)
   added: (in obj22 tru1)
   goals met: 4 of 9
22. (unload-airplane obj21 apn1 apt1)
   deleted: (in obj21 apn1)
   added: (at obj21 apt1)
   goals met: 4 of 9
23. (load-truck obj21 tru1 apt1)
   deleted: (at obj21 apt1)
   added: (in obj21 tru1)
   goals met: 4 of 9
24. (drive-truck tru1 apt1 pos1 cit1)
   deleted: (at tru1 apt1)
   added: (at tru1 pos1)
   goals met: 5 of 9
25. (unload-truck obj23 tru1 pos1)
   deleted: (in obj23 tru1)
   added: (at obj23 pos1)
   goals met: 6 of 9
26. (unload-truck obj22 tru1 pos1)
   deleted: (in obj22 tru1)
   added: (at obj22 pos1)
   goals met: 7 of 9
27. (unload-truck obj21 tru1 pos1)
   deleted: (in obj21 tru1)
   added: (at obj21 pos1)
   goals met: 8 of 9
28. (fly-airplane apn1 apt1 apt2)
   deleted: (at apn1 apt1)
   added: (at apn1 apt2)
   goals met: 9 of 9
